
library(expm)

mx = matrix(c(0, 0.04, 0.12, 0.13, 0.22, 0, 0.11, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                0.57, 0, 0, 0.37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                0.39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.47, 0, 0, 0, 0,
                0.09, 0.22, 0.26, 0, 0.14, 0, 0, 0, 0.02, 0.25, 0, 0, 0, 0, 0, 0,
                0, 0, 0, 0, 0, 0, 0, 0, 0.33, 0.17, 0.16, 0.07, 0, 0, 0, 0,
                0.37, 0.05, 0, 0, 0, 0, 0.21, 0, 0.06, 0, 0, 0.29, 0, 0, 0, 0,
                0, 0, 0, 0, 0, 0.15, 0, 0, 0, 0.74, 0, 0, 0, 0, 0, 0,
                0, 0, 0, 0, 0, 0, 0.9, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                0, 0, 0, 0, 0, 0, 0.36, 0, 0, 0.27, 0, 0, 0, 0, 0.13, 0,
                0, 0, 0, 0, 0.27, 0, 0, 0, 0.27, 0, 0, 0, 0.15, 0, 0, 0.1,
                0, 0, 0, 0.27, 0, 0.22, 0, 0, 0, 0, 0, 0.18, 0, 0, 0.27, 0,
                0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.15, 0, 0, 0, 0.2, 0,
                0, 0, 0, 0, 0, 0, 0, 0, 0, 0.74, 0, 0, 0, 0, 0, 0,
                0, 0, 0, 0, 0, 0, 0, 0.39, 0.26, 0, 0, 0.01, 0, 0, 0.29, 0,
                0, 0, 0, 0, 0, 0, 0, 0, 0.41, 0, 0, 0.19, 0, 0, 0, 0.21,
                0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.29, 0, 0, 0.29, 0), nrow=16, ncol=16, byrow = TRUE )


for (i in 1:16) {
  
  value = 0
  for (j in 1:16) {
    value = value + mx[i + 16 * (j - 1)]
  }
  
  mx[i + 16 * (i - 1)] = round(1 - value, 2)
}

#print(mx)


print('---Задание 1---')


mx_pow = mx %^% 6 
print(c('1) вероятность того, что за 6 шагов система перейдет из состояния 9 в состояние 11 = ', mx_pow[9, 11]))


A0 = c(0.08, 0.02, 0.02, 0.12, 0.07, 0.1, 0.03, 0.02, 0.07, 0.11, 0.09, 0.08, 0.04, 0.11, 0.04, 0)
A = A0 %*% (mx %^% 10 )

print(c('2) вероятности состояний системы спустя 10 шагов:', A))


mxFirst = function(mx, k) {
  if (k <= 1) {
    
    return(mx)
    
  } else {
    
    result = mx 
    mx1 = mxFirst(mx, k-1) 
    for (i in 1:ncol(mx)) {
      
      for (j in 1:ncol(mx)) {
        
        result[i,j] = 0
        for (m in 1:ncol(mx)) {
          
          if (m!=j) {
            result[i,j] = result[i,j] + mx[i,m] * mx1[m,j]
          }
        }
      }
    }
    
    return(result)
    
  }
}

mx_first = mxFirst(mx, 8)
print(c('3) вероятность первого перехода за 8 шагов из состояния 16 в состояние 10 =', mx_first[16, 10]))


res7 = mx

for (k in 2:8) {
  res7 = res7 + mxFirst(mx, k)
}
  
print(c('4) вероятность перехода из состояния 7 в состояние 4 не позднее чем за 7 шагов =', res7[7, 4]))


res = mx
for (k in 2:100) {
  res = res + k * mxFirst(mx, k)
}
  
print(c('5) среднее количество шагов для перехода из состояния 8 в состояние 2 =', res[8, 2]))


firstReturn = function(p,K) {
  if (K<=1) {
    
    return(p)
    
  } else {
    
    d_ar = c(dim(p), K)
    pk = array(dim = d_ar)
    for (i in 1:K)
      pk[,,i] = p %^% i
    
    fjj = pk
    for (k in 2:K) 
    {
      for (m in 1:(k-1))
        fjj[,,k] = fjj[,,k]-fjj[,,m]*pk[,,k-m]      
    }
    return(fjj[,,K])
  }
}
Fjj_k(P, 9)[9,9]











